cf_billing/Documents/энргУстановитьТехническуюВозможностьУстановкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьТехническуюВозможностьУстановкиПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргТехническаяВозможностьУстановкиПУ</xr:Item>
				<xr:Item>InformationRegister.энргУслугиТочекУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НетВозможностьУстановкиПУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьТехническуюВозможностьУстановкиПУ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает пустой массив абонентов плательщиков.
// 
// Возвращаемое значение:
//   Массив
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 				= Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	МКДОткрыт 			= Истина;		
	
	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;

	Если не МКДОткрыт тогда
		Отказ			= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьТехническуюВозможностьУстановкиПУ(ДанныеШапки,Движения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("Организация",				Организация); 
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);	

	Возврат ДанныеШапки;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
